package cn.qqtheme.framework;

/**
 * ***********************************************
 * **                  _oo0oo_                  **
 * **                 o8888888o                 **
 * **                 88" . "88                 **
 * **                 (| -_- |)                 **
 * **                 0\  =  /0                 **
 * **               ___/'---'\___               **
 * **            .' \\\|     |// '.             **
 * **           / \\\|||  :  |||// \\           **
 * **          / _ ||||| -:- |||||- \\          **
 * **          | |  \\\\  -  /// |   |          **
 * **          | \_|  ''\---/''  |_/ |          **
 * **          \  .-\__  '-'  __/-.  /          **
 * **        ___'. .'  /--.--\  '. .'___        **
 * **     ."" '<  '.___\_<|>_/___.' >'  "".     **
 * **    | | : '-  \'.;'\ _ /';.'/ - ' : | |    **
 * **    \  \ '_.   \_ __\ /__ _/   .-' /  /    **
 * **====='-.____'.___ \_____/___.-'____.-'=====**
 * **                  '=---='                  **
 * ***********************************************
 * **              佛祖保佑  镇类之宝              **
 * ***********************************************
 *
 * @author 李玉江[QQ:1032694760]
 * @since 2014-09-05 11:49
 */
public class AppConfig {
    /**
     * LogCat的标记
     */
    public static final String DEBUG_TAG = "liyujiang";
    /**
     * 是否调试模式
     */
    public static final boolean DEBUG_ENABLE = false;
    /**
     * 是否开启离线核查模式
     */
    public static final boolean USE_OFFLINE_CHECK = true;
    /**
     * 是否开启离线登录模式
     */
    public static final boolean USE_OFFLINE_LOGIN = false;
    /**
     * 是否开启三道防线数据
     */
    public static final boolean USE_SDFX = true;
}
